10/data/attachments/6fbe8f092879de3a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7444482f-8ed0-41ff-ad95-d03ed854b623</nif:username>
            <nif:friendToBeAdded>Thomas_together_Friend_4328_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>